content-org/non_personal_lists.org
#+hugo_section: public_lists

* Digital Warrior
:PROPERTIES:
:EXPORT_FILE_NAME: digital_warrior
:END:
** Spare server lying around?
- [[https://wiki.archiveteam.org/index.php/ArchiveTeam_Warrior][ArchiveTeam Warrior]] : The Archive Team Warrior is a virtual archiving appliance. You can run it to help with the Archive Team archiving efforts. It will download sites and upload them to our archive—and it’s really easy to do!
- [[https://en.wikipedia.org/wiki/List_of_distributed_computing_projects][List of distributed computing projects]] : This is a list of distributed computing and grid computing projects. For each project, donors volunteer computing time from personal computers to a specific cause. The donated computing power comes typically from CPUs and GPUs in personal computers or video game consoles.
** Online Privacy and Security
- [[https://github.com/tycrek/degoogle][tycrek/degoogle]] : A huge list of alternatives to Google products. Privacy tips, tricks, and links.
- [[https://restoreprivacy.com/5-eyes-9-eyes-14-eyes/][Five Eyes, Nine Eyes, 14 Eyes (What to Avoid in 2022)]]
- [[https://github.com/narwhalacademy/zebra-crossing][narwhalacademy/zebra-crossing]] : Zebra Crossing: an easy-to-use digital safety checklist
- [[https://github.com/Lissy93/personal-security-checklist][Lissy93/personal-security-checklist]] : A curated checklist of 300+ tips for protecting digital security and privacy in 2022
- [[https://github.com/mayfrost/guides/blob/master/CHECKLIST.md][mayfrost/guides]] : Security in orders of difficulty
** Organizational and Sever security
- [[https://github.com/lfit/itpol][lfit/itpol]] : Useful IT policies
- [[https://github.com/imthenachoman/How-To-Secure-A-Linux-Server][imthenachoman/How-To-Secure-A-Linux-Server]] : An evolving how-to guide for securing a Linux server.
- [[https://github.com/StevenBlack/hosts][StevenBlack/hosts]] : Consolidating and extending hosts files from several well-curated sources. Optionally pick extensions for porn, social media, and other categories.
- [[https://madaidans-insecurities.github.io/guides/linux-hardening.html][Linux Hardening Guide]]
- [[https://github.com/securitywithoutborders/hardentools][securitywithoutborders/hardentools]] : Hardentools simply reduces the attack surface on Microsoft Windows computers by disabling low-hanging fruit risky features.
** Activism / Journalism and Anonymity
- [[https://github.com/caffeine-overload/bandinchina][caffeine-overload/bandinchina]] : Naming and shaming companies who kowtow to Chinese censorship requests
- [[https://anonymousplanet-ng.org/guide.html][Full guide on online anonymity]]
- [[https://tdarb.org/blog-anonymously/index.html][Blogging as an anon]]
- [[https://k3tan.com/starting-a-new-digital-identity][Starting a new digital identity | k3tan.com]]
- [[https://github.com/CrowdStrike/travel-laptop][CrowdStrike/travel-laptop]]
