content/public_lists/digital_warrior.md
+++
title = "Digital Warrior"
author = ["Hrishikesh Barman"]
draft = false
+++

## Spare server lying around? {#spare-server-lying-around}

-   [ArchiveTeam Warrior](https://wiki.archiveteam.org/index.php/ArchiveTeam_Warrior) : The Archive Team Warrior is a virtual archiving appliance. You can run it to help with the Archive Team archiving efforts. It will download sites and upload them to our archive—and it’s really easy to do!
-   [List of distributed computing projects](https://en.wikipedia.org/wiki/List_of_distributed_computing_projects) : This is a list of distributed computing and grid computing projects. For each project, donors volunteer computing time from personal computers to a specific cause. The donated computing power comes typically from CPUs and GPUs in personal computers or video game consoles.


## Online Privacy and Security {#online-privacy-and-security}

-   [tycrek/degoogle](https://github.com/tycrek/degoogle) : A huge list of alternatives to Google products. Privacy tips, tricks, and links.
-   [Five Eyes, Nine Eyes, 14 Eyes (What to Avoid in 2022)](https://restoreprivacy.com/5-eyes-9-eyes-14-eyes/)
-   [narwhalacademy/zebra-crossing](https://github.com/narwhalacademy/zebra-crossing) : Zebra Crossing: an easy-to-use digital safety checklist
-   [Lissy93/personal-security-checklist](https://github.com/Lissy93/personal-security-checklist) : A curated checklist of 300+ tips for protecting digital security and privacy in 2022
-   [mayfrost/guides](https://github.com/mayfrost/guides/blob/master/CHECKLIST.md) : Security in orders of difficulty


## Organizational and Sever security {#organizational-and-sever-security}

-   [lfit/itpol](https://github.com/lfit/itpol) : Useful IT policies
-   [imthenachoman/How-To-Secure-A-Linux-Server](https://github.com/imthenachoman/How-To-Secure-A-Linux-Server) : An evolving how-to guide for securing a Linux server.
-   [StevenBlack/hosts](https://github.com/StevenBlack/hosts) : Consolidating and extending hosts files from several well-curated sources. Optionally pick extensions for porn, social media, and other categories.
-   [Linux Hardening Guide](https://madaidans-insecurities.github.io/guides/linux-hardening.html)
-   [securitywithoutborders/hardentools](https://github.com/securitywithoutborders/hardentools) : Hardentools simply reduces the attack surface on Microsoft Windows computers by disabling low-hanging fruit risky features.


## Activism / Journalism and Anonymity {#activism-journalism-and-anonymity}

-   [caffeine-overload/bandinchina](https://github.com/caffeine-overload/bandinchina) : Naming and shaming companies who kowtow to Chinese censorship requests
-   [Full guide on online anonymity](https://anonymousplanet-ng.org/guide.html)
-   [Blogging as an anon](https://tdarb.org/blog-anonymously/index.html)
-   [Starting a new digital identity | k3tan.com](https://k3tan.com/starting-a-new-digital-identity)
-   [CrowdStrike/travel-laptop](https://github.com/CrowdStrike/travel-laptop)
